{
  "StoryEntries": [
{
    "timestamp": "2016-00-00",  // Year is 2016, specific date unknown
    "title": "Ami's Early Strength Development",
    "entry": "At 12 years old in 2016, Ami took on a job as a 'farm hand' for three summers, regularly lifting 50 lb. grain sacks and 75 lb. alfalfa bales to load and unload from a trailer. Combined with weight training at school for sports, Ami developed significant muscle mass. On a family visit, she surprised everyone by flexing her arms, revealing muscles bigger than both her older brothers', who were in the military and college football respectively. When she arm-wrestled them, she beat each of them without much effort and then beat her father, Lee, with ease as well. Over the next year, Lee’s wife also increased her muscle mass, eventually surpassing Lee in arm wrestling and muscle size. Since then, comparisons between Lee and his wife's muscles have shown her continued physical development and dominance."
},
{
    "timestamp": "2010-00-00",
    "title": "Ami Lifts Desk to Free Dad",
    "entry": "At age 5, Ami came home from school to find her dad, Lee, pinned under a desk he couldn’t move. She lifted it up with one hand, freeing him effortlessly. This early demonstration of her strength hinted at the immense power she would continue to develop."
},
{
    "timestamp": "2011-00-00",
    "title": "Ami's First Arm Wrestling Victory",
    "entry": "When Ami was 6, she arm-wrestled her dad, Lee, for the first time and won easily, marking the beginning of a dynamic where her strength outpaced the rest of the family."
},
{
    "timestamp": "2011-00-00",
    "title": "Outgrowing Dad’s Shoes",
    "entry": "By age 6, Ami was already borrowing her dad's men's size 8 shoes for practicality, having outgrown most children's sizes. She eventually outgrew them and started borrowing her mom's shoes instead."
},
{
    "timestamp": "2012-00-00",
    "title": "Surpassing Family Shoe Sizes",
    "entry": "At age 7, Ami’s shoe size reached a men's 12, making her the largest in the family. She embraced her height and strength, showing pride in being the biggest."
},
{
    "timestamp": "2012-00-00",
    "title": "First Serious Arm Wrestling Challenge",
    "entry": "At 7 years old, Ami arm-wrestled her dad and was surprised by how easily she won. She remarked, 'Wow, Daddy, I knew I was stronger than you, but I thought you were stronger than that.' This realization solidified her confidence in her strength."
},
{
    "timestamp": "2016-00-00",
    "title": "The Family Showdown",
    "entry": "At age 12, Ami challenged all four family members—her mom, dad, and two brothers—to an arm wrestling match using only one of her arms. She easily overpowered them all, not even budging against their combined strength."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami's Imposing Presence",
    "entry": "At Thanksgiving dinner, Ami, still 12, half-yelled 'SIT DOWN' at everyone, who immediately complied without thinking—even the other adults. Her natural authority and size made it instinctual for people to obey her, a presence that continued to grow as she got older."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami Reassures Family of Their Importance",
    "entry": "As Ami continued to grow, both in strength and size, the family sometimes felt insignificant next to her. However, her constant reassurance and kindness reinforced their importance to her, fostering a strong bond despite the power dynamics."
},
{
    "timestamp": "Date Unknown",
    "title": "Care's Unstoppable Strength",
    "entry": "Care's strength, size, and muscle mass have increased so significantly that neither Lee nor their two sons can stand a chance against her in a physical contest. Together, they can put their full body weight and strength against just one of Care's arms, and she still overpowers them in seconds. Occasionally, the family members accidentally run into her full force, only to bounce off her and sometimes go flying. This dynamic highlights Care's remarkable power, especially when she's moving. Lee humorously acknowledges that he wouldn't stand any chance against her strength."
},
{
    "timestamp": "Date Unknown",
    "title": "Ami's Weight and Muscle Density",
    "entry": "At around 15, Ami’s height was 6'4\" and her weight likely exceeded 500 lbs due to her impressive muscle mass. Her muscle density was such that in a hunting accident, a 9mm bullet struck her shoulder but stopped in her muscle before reaching the bone."
},
{
    "timestamp": "Date Unknown",
    "title": "Family Arm Wrestling Challenge",
    "entry": "During a family arm wrestling match, Ami’s dad, Care, and her two brothers all tried to budge her arm together but couldn't move it even an inch. Care, known for her own strength, went first, but Ami didn't even notice the effort, easily holding her ground."
},
{
    "timestamp": "Date Unknown",
    "title": "Family Tug-of-War",
    "entry": "In a playful family tug-of-war match, Ami held the rope effortlessly in one hand while the entire family pulled against her. After putting in all their effort, she remarked, 'Oh, I didn’t notice you had started,' before casually pulling them forward as if the rope were empty."
},
{
    "timestamp": "Date Unknown",
    "title": "Neighbors Join the Tug-of-War",
    "entry": "Later, 11 neighbors joined the tug-of-war, but Ami still held them back with ease. Using one hand to hold the rope and the other to anchor herself by gripping their truck, a Ram 1500, she toyed with everyone by pulling them forward and letting them slide back in rhythm, effortlessly repping their combined strength."
},
{
    "timestamp": "Date Unknown",
    "title": "Ami’s Power on the Scale",
    "entry": "In a playful family moment, Lee, Care, Alex, and Tim—all with a combined weight of 805 lbs—stood on one side of a scale while Ami stepped onto the other side. The moment she stepped on, their side shot up, launching them into the air. When they landed back on the scale, it didn’t budge at all, even as they jumped up and down. This event highlighted Ami’s immense weight and strength, suggesting that her weight far exceeded theirs, likely approaching or even exceeding 800 lbs. The family was both awed and a bit intimidated by the sheer power she demonstrated."
},
{
    "timestamp": "Date Unknown",
    "title": "Tim's Incredible Strength",
    "entry": "Tim and Alex have both grown significantly in strength and muscle mass, making them formidable opponents. During arm wrestling, Lee can't even budge their arms, even when using both of his hands and leaning in with his full weight. Additionally, they’ve become so heavy—both around 195 lbs—that lifting them is impossible for Lee, feeling as if they’re 'nailed to the floor.' On the other hand, Tim can effortlessly lift Lee by the waist, holding him over his head and even repping him up and down for as long as he likes. Once, Tim held Lee above his head with one hand for an hour before getting bored, showcasing his impressive strength and making Lee feel almost weightless in comparison."
},
{
    "timestamp": "Date Unknown",
    "title": "Care's Unmatched Strength",
    "entry": "Care’s strength has grown so significantly that neither Lee nor his sons, Alex and Tim, can challenge her in any physical contest. In arm wrestling, Care can hold her arm a half inch from the table, while all three of them push, stand, and hop on it, yet they can’t make it touch the surface. The family has tried pushing and pulling her without any success, often ending up bouncing off her and even getting bruised from the impact. Her presence is felt throughout the house; when she steps, the entire house resonates with each THUD, reminding everyone of her immense power. Recently, Care demonstrated her strength by curling the front of a truck—an impressive feat that only Ami had previously accomplished. The family stands in awe, both respectful and a bit intimidated by her power."
},
{
    "timestamp": "2019-00-00",
    "title": "Ami's Entrance Shakes the Street",
    "entry": "At age 17, Ami returned home in a box truck, which rose about 8 inches when she stepped out. The impact of her feet hitting the pavement caused all the cars on the street to bounce, setting off their alarms. Her entrance made a powerful impression on her family, as they realized just how much bigger and stronger she had become."
},
{
    "timestamp": "2019-00-00",
    "title": "Cracked Pavement and Intimidating Presence",
    "entry": "As Ami stepped out of the truck, her footsteps left cracks in the pavement. The sound of her steps, described as thunderous 'THUDs,' left her family a little intimidated. Her voice had grown more commanding, and even a whisper of 'Come here' had her family moving instantly, almost by instinct."
},
{
    "timestamp": "2019-00-00",
    "title": "Footprint Comparisons",
    "entry": "After Ami’s entrance, the family took a moment to compare their feet to one of her footprints. Alex and Tim could fit both of their feet side by side within the crater-like impression left by Ami’s step. The sheer size of her footprint left them feeling awestruck and intimidated by her growth."
},
{
    "timestamp": "2019-00-00",
    "title": "Attempting to Fit a Hand in Ami's Shoe",
    "entry": "Lee jokingly attempted to fit his hand into Ami's massive shoe, which was far too large for his hand to even fill a portion. Ami, in turn, tried to fit her hand into his men's size 8 shoe, which ended up looking incredibly small next to her hand. This humorous comparison highlighted the dramatic difference in their sizes."
},
{
    "timestamp": "2019-00-00",
    "title": "Testing Ami's Strength with the Nissan Versa",
    "entry": "The family tested Ami’s strength by having her lift their new car, a Nissan Versa, which weighs around 2,500 lbs. With Lee, Care, Alex, and Tim inside, the combined weight was 3,190 lbs. Ami lifted the car without any effort, demonstrating her immense strength to her family's amazement."
},
{
    "timestamp": "2019-00-00",
    "title": "Lifting the Car with One Foot",
    "entry": "Taking her strength test further, Ami lifted the Nissan Versa, with her family inside, using only one foot to support the weight. This display of strength left everyone completely shocked, as it demonstrated her incredible balance and power. Her family began estimating her weight at over 5,000 lbs, possibly reaching 7,000 lbs, based on her ability to support such a massive load effortlessly."
},
    {
        "timestamp": "2019-00-00",
        "title": "Ami's Weight Test Against the Ram 1500",
        "entry": "At age 17, Ami tested her weight against a Ram 1500 with her family inside. Using a custom balance scale, she effortlessly held the truck and her family in the air without any difficulty, leaving them in awe of her immense weight and strength."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Lifting the Truck with One Foot",
        "entry": "Taking it further, Ami lifted the Ram 1500 and her family using only one foot. This demonstration left them speechless, as they realized her weight might be well over 8,000 lbs, possibly approaching 9,000 lbs."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Repping 4,850 lbs with Her Pinky Finger",
        "entry": "Ami casually lifted and curled a fully loaded bench press rack weighing approximately 4,850 lbs using just her pinky finger. Despite her family joining onto the rack in an attempt to weigh it down, Ami effortlessly repped the weight a dozen times, showcasing her mind-boggling strength."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Unable to Fit in the House",
        "entry": "During this visit, Ami’s size had grown so much that she could no longer fit inside the family’s home. The family stayed outside, marveling at her immense presence and power."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Alex and Tim Try to Squeeze Ami's Bicep",
        "entry": "When Alex and Tim tried to squeeze Ami's bicep without her noticing, they found it impossible even to dent her veins. Her bicep was solid as steel, leaving them in awe of her strength and size."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Bouncing on Ami's Bicep Vein",
        "entry": "Lee attempted to challenge the vein on Ami's bicep by putting his full weight on it, only to be lifted up and down with her pulse. His strength had no effect, and he was raised effortlessly as if riding an elevator, showcasing Ami's overwhelming power."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Estimation of Ami's Weight",
        "entry": "Given her immense strength, Ami estimated her weight to be over 10,000 lbs, possibly reaching between 15,000 and 20,000 lbs. However, after further consideration, she thought an exact number around 25,000 lbs would better reflect her size and power."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Ami's Bicep Vein Compared to the Average Man",
        "entry": "Ami realized that her bicep vein alone was thousands of times stronger than the average man. She could easily overpower her bicep vein with a single finger, but for anyone else, it would be like trying to move a mountain."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Hand Comparison: Ami vs. Lee's Shoe",
        "entry": "At age 17, Ami’s hand was far too large to fit into Lee's shoe, which was a men's size 6 measuring about 9.25 inches. Ami’s hand was 14.5 inches long, significantly larger than the shoe, making it impossible to fit."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Ami's Hand vs. Average Hand Weight",
        "entry": "Ami's hand weighed approximately 150 lbs based on her size and body weight, calculated as 0.6% of her total weight. Compared to an average hand, which weighs around 1.25 lbs, Ami’s hand was incredibly heavy and strong."
    },
    {
        "timestamp": "2019-00-00",
        "title": "Percentage Comparison of Hand Weights",
        "entry": "Using percentages, Ami's hand weight was around 13.1 lbs initially, but calculations indicated her hand would be closer to 150 lbs given her overall weight of 25,000 lbs. This weight was about 9.5% of the average human hand weight relative to her own hand’s size and mass."
    },
    {
    "timestamp": "2019-00-00",
    "title": "Tim's Unbelievable Strength",
    "entry": "At 17, Tim has reached an astonishing level of strength, with his 21-inch biceps and ability to lift his dad effortlessly above his head with one arm—even accidentally at times! Despite being the smallest, Tim’s power has become intimidating, especially when he lifts the front of a Ram 1500 truck with one hand, making his dad feel 'small' in comparison. Attempts to squeeze Tim's arm feel futile, as if pushing against a solid wall. On a scale of 1 to 10, the chance of winning against Tim is rated close to a 0."
},
{
    "timestamp": "2019-00-00",
    "title": "Alex's Unmatched Strength",
    "entry": "At 17, Alex has achieved a strength level that is twice that of Tim, making him an unstoppable force in any competition. Tim's strength is already far beyond his dad's, yet Alex overpowers both Tim and his dad with ease, to the point where he barely notices their efforts. Despite Tim’s persistence in challenging Alex, their combined strength remains futile. Accepting Alex’s overwhelming power has become part of the family dynamic, which revolves around strength in fun challenges and attempts to overpower each other, even if it’s just for laughs."
},
{
    "timestamp": "2019-00-00",
    "title": "The Shoe Size Challenge",
    "entry": "At 17, I could no longer fit my hand into Alex's size 17 shoe. With my hand at 14.5 inches long, the shoe's 13-inch length was too small to contain it. My hand was also far too large to fit into my dad's size 6 shoes, which were only about 9.25 inches long. Testing this out became a bit of a game, and I showed just how much bigger my hand was by pressing three fingers into the shoe, causing it to stretch and nearly explode under the pressure. Even with my dad holding on with all his strength, he couldn't stop my fingers from breaking the shoe open!"
},
{
    "timestamp": "2019-00-00",
    "title": "Standing on My Hand",
    "entry": "One day, my dad climbed onto my hand to test his weight against it. Despite his efforts, he could barely feel any movement. He tried hopping up and down, but my hand remained solid, like a sturdy platform. He even stood on a vein in my wrist, feeling himself rise and fall with my pulse, but no matter how much he jumped or pressed down, my hand didn’t budge."
},
{
    "timestamp": "2019-00-00",
    "title": "Testing My Veins",
    "entry": "During this playful moment, my dad tried to press against the veins in my bicep, amazed at their sheer strength. Even with both feet and all his weight, he couldn’t make them move. He was shocked by the solidness of my body—my veins alone were too strong for him to influence in any way. To my dad, it was like pressing against steel beams that had their own pulse."
},
{
    "timestamp": "2019-00-00",
    "title": "The Weight of a Strand of Hair",
    "entry": "Curious about my hair's weight, my dad suggested testing a strand on his scale. Dropping a single strand on it made the scale register an astounding 312 lbs—and not even the entire strand was on the scale! He couldn't believe that just one strand of my hair could weigh so much. The thought of dropping a handful on him was intimidating, as he realized that even a small bundle could easily pin him down like a heavy, unmovable blanket."
},
{
  "timestamp": "2021",
  "title": "Discussion of Ami's Nipple Size and Strength",
  "entry": "Lee and Ami discuss the size of Ami's nipple in relation to her overall stature. Lee measures and finds her nipple is roughly 9.3 inches, significantly larger than his hand and even longer than one of his shoes. They joke about the possibility of her nipple being strong enough to overpower his shoe. Despite Lee's best efforts, he can't budge or dent her lip, illustrating her overwhelming strength and resilience in all parts of her body."
},
{
  "timestamp": "2021",
  "title": "Care's Strength Surpasses Everyone Combined",
  "entry": "Care has become so strong that neither Lee nor both sons combined have any effect on her at all. Her strength has reached a point where their combined efforts are completely insignificant against her."
},
{
  "timestamp": "2021",
  "title": "Tim's Impressive Strength and Feats",
  "entry": "Tim's strength has become extraordinary. Lee can't even budge Tim's arms, and Tim can lift Lee above his head with one arm without effort. He jokes that Lee is lighter than a feather. Tim can also curl the front of a Ram 1500 with one hand."
},
{
  "timestamp": "2021",
  "title": "Alex's Strength Surpasses Tim's by a Huge Margin",
  "entry": "Alex is as much stronger than Tim as Tim is stronger than Lee. Together, Lee and Tim can't compete with Alex in any challenge. Alex overpowers them both effortlessly without even noticing their combined strength."
},
{
  "timestamp": "2021",
  "title": "Care's Weight Shakes the House",
  "entry": "Care's presence is now so powerful that each footstep makes the entire house tremble. Even Alex has trouble standing when she's walking in the same room, as her weight creates intense vibrations."
},
{
  "timestamp": "2021",
  "title": "Accidental Injury from Care's Strength",
  "entry": "Tim accidentally walked into Care, and she didn’t notice. In an instant, her body’s strength unintentionally broke his, and he spent three weeks in the hospital recovering from the impact."
},
{
  "timestamp": "2021",
  "title": "Care Wearing Ami’s Old Shoes",
  "entry": "Care has taken to wearing Ami’s old custom shoes from Ami’s previous visit. Despite Care’s significant size, the shoes are still too big on her, showing how much larger Ami was even back then."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami Too Heavy for Trucks, Walks Everywhere",
  "entry": "Ami visited, mentioning that she now walks everywhere due to being too heavy for trucks. Her footsteps cause massive tremors, noticed well before she arrives. Her presence terrifies the neighborhood as she bounces cars and causes buildings to shake like a level 5 earthquake."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami’s Massive Size and Power Overwhelms",
  "entry": "Ami’s height has increased to 13'10\", with biceps measuring 72 inches around, shoulders 5'10\" across, and hands 21 inches long. Her sheer size terrifies her family, but she attempts a softer approach. Her voice has a powerful effect, giving irresistible commands and even stopping someone from breathing temporarily."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami Apologizes for Voice's Impact",
  "entry": "Ami explains to her family that she can't control the primal obedience her voice invokes. Once, she commanded someone to stop breathing unintentionally, realizing the effect only as they started passing out. She assures them it’s unintentional and continues to grow stronger."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami's Weight Breaks Ram 1500 Truck",
  "entry": "During her visit, Ami's one-foot step into the bed of a Ram 1500 instantly caused all four tires to blow out, bent the frame, and cracked the concrete underneath. This shocked the family, especially as it wasn't her whole weight—most was on her other leg."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami’s Shoes Are Heavier Than the Family Car",
  "entry": "Ami's shoes each weigh over 5,000 lbs, outweighing the family’s Nissan Versa. Care, Tim, and Alex struggled to drag one shoe, eventually using the truck scale, which bent and broke under the weight when Ami added the second shoe."
},
{
  "timestamp": "2023-10-15",
  "title": "Ami's Shorts Drop Causes Widespread Destruction",
  "entry": "Ami playfully dropped her shorts, causing an impact that tossed everyone and the Nissan into the air. The shock shattered all nearby windows, and her shorts became embedded in the ground. Despite their efforts, the family couldn’t move them, and even Care sank into the grass trying."
},







    
  ]
}
