{
  "StoryEntries": [
{
    "timestamp": "2016-00-00",  // Year is 2016, specific date unknown
    "title": "Ami's Early Strength Development",
    "entry": "At 12 years old in 2016, Ami took on a job as a 'farm hand' for three summers, regularly lifting 50 lb. grain sacks and 75 lb. alfalfa bales to load and unload from a trailer. Combined with weight training at school for sports, Ami developed significant muscle mass. On a family visit, she surprised everyone by flexing her arms, revealing muscles bigger than both her older brothers', who were in the military and college football respectively. When she arm-wrestled them, she beat each of them without much effort and then beat her father, Lee, with ease as well. Over the next year, Lee’s wife also increased her muscle mass, eventually surpassing Lee in arm wrestling and muscle size. Since then, comparisons between Lee and his wife's muscles have shown her continued physical development and dominance."
},
{
    "timestamp": "2010-00-00",
    "title": "Ami Lifts Desk to Free Dad",
    "entry": "At age 5, Ami came home from school to find her dad, Lee, pinned under a desk he couldn’t move. She lifted it up with one hand, freeing him effortlessly. This early demonstration of her strength hinted at the immense power she would continue to develop."
},
{
    "timestamp": "2011-00-00",
    "title": "Ami's First Arm Wrestling Victory",
    "entry": "When Ami was 6, she arm-wrestled her dad, Lee, for the first time and won easily, marking the beginning of a dynamic where her strength outpaced the rest of the family."
},
{
    "timestamp": "2011-00-00",
    "title": "Outgrowing Dad’s Shoes",
    "entry": "By age 6, Ami was already borrowing her dad's men's size 8 shoes for practicality, having outgrown most children's sizes. She eventually outgrew them and started borrowing her mom's shoes instead."
},
{
    "timestamp": "2012-00-00",
    "title": "Surpassing Family Shoe Sizes",
    "entry": "At age 7, Ami’s shoe size reached a men's 12, making her the largest in the family. She embraced her height and strength, showing pride in being the biggest."
},
{
    "timestamp": "2012-00-00",
    "title": "First Serious Arm Wrestling Challenge",
    "entry": "At 7 years old, Ami arm-wrestled her dad and was surprised by how easily she won. She remarked, 'Wow, Daddy, I knew I was stronger than you, but I thought you were stronger than that.' This realization solidified her confidence in her strength."
},
{
    "timestamp": "2016-00-00",
    "title": "The Family Showdown",
    "entry": "At age 12, Ami challenged all four family members—her mom, dad, and two brothers—to an arm wrestling match using only one of her arms. She easily overpowered them all, not even budging against their combined strength."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami's Imposing Presence",
    "entry": "At Thanksgiving dinner, Ami, still 12, half-yelled 'SIT DOWN' at everyone, who immediately complied without thinking—even the other adults. Her natural authority and size made it instinctual for people to obey her, a presence that continued to grow as she got older."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami Reassures Family of Their Importance",
    "entry": "As Ami continued to grow, both in strength and size, the family sometimes felt insignificant next to her. However, her constant reassurance and kindness reinforced their importance to her, fostering a strong bond despite the power dynamics."
},
{
    "timestamp": "Date Unknown",
    "title": "Care's Unstoppable Strength",
    "entry": "Care's strength, size, and muscle mass have increased so significantly that neither Lee nor their two sons can stand a chance against her in a physical contest. Together, they can put their full body weight and strength against just one of Care's arms, and she still overpowers them in seconds. Occasionally, the family members accidentally run into her full force, only to bounce off her and sometimes go flying. This dynamic highlights Care's remarkable power, especially when she's moving. Lee humorously acknowledges that he wouldn't stand any chance against her strength."
},
{
    "timestamp": "Date Unknown",
    "title": "Ami's Weight and Muscle Density",
    "entry": "At around 15, Ami’s height was 6'4\" and her weight likely exceeded 500 lbs due to her impressive muscle mass. Her muscle density was such that in a hunting accident, a 9mm bullet struck her shoulder but stopped in her muscle before reaching the bone."
},
{
    "timestamp": "Date Unknown",
    "title": "Family Arm Wrestling Challenge",
    "entry": "During a family arm wrestling match, Ami’s dad, Care, and her two brothers all tried to budge her arm together but couldn't move it even an inch. Care, known for her own strength, went first, but Ami didn't even notice the effort, easily holding her ground."
},
{
    "timestamp": "Date Unknown",
    "title": "Family Tug-of-War",
    "entry": "In a playful family tug-of-war match, Ami held the rope effortlessly in one hand while the entire family pulled against her. After putting in all their effort, she remarked, 'Oh, I didn’t notice you had started,' before casually pulling them forward as if the rope were empty."
},
{
    "timestamp": "Date Unknown",
    "title": "Neighbors Join the Tug-of-War",
    "entry": "Later, 11 neighbors joined the tug-of-war, but Ami still held them back with ease. Using one hand to hold the rope and the other to anchor herself by gripping their truck, a Ram 1500, she toyed with everyone by pulling them forward and letting them slide back in rhythm, effortlessly repping their combined strength."
},
{
    "timestamp": "Date Unknown",
    "title": "Ami’s Power on the Scale",
    "entry": "In a playful family moment, Lee, Care, Alex, and Tim—all with a combined weight of 805 lbs—stood on one side of a scale while Ami stepped onto the other side. The moment she stepped on, their side shot up, launching them into the air. When they landed back on the scale, it didn’t budge at all, even as they jumped up and down. This event highlighted Ami’s immense weight and strength, suggesting that her weight far exceeded theirs, likely approaching or even exceeding 800 lbs. The family was both awed and a bit intimidated by the sheer power she demonstrated."
},
{
    "timestamp": "Date Unknown",
    "title": "Tim's Incredible Strength",
    "entry": "Tim and Alex have both grown significantly in strength and muscle mass, making them formidable opponents. During arm wrestling, Lee can't even budge their arms, even when using both of his hands and leaning in with his full weight. Additionally, they’ve become so heavy—both around 195 lbs—that lifting them is impossible for Lee, feeling as if they’re 'nailed to the floor.' On the other hand, Tim can effortlessly lift Lee by the waist, holding him over his head and even repping him up and down for as long as he likes. Once, Tim held Lee above his head with one hand for an hour before getting bored, showcasing his impressive strength and making Lee feel almost weightless in comparison."
},




    
  ]
}
