{
  "StoryEntries": [
{
    "timestamp": "2016-00-00",  // Year is 2016, specific date unknown
    "title": "Ami's Early Strength Development",
    "entry": "At 12 years old in 2016, Ami took on a job as a 'farm hand' for three summers, regularly lifting 50 lb. grain sacks and 75 lb. alfalfa bales to load and unload from a trailer. Combined with weight training at school for sports, Ami developed significant muscle mass. On a family visit, she surprised everyone by flexing her arms, revealing muscles bigger than both her older brothers', who were in the military and college football respectively. When she arm-wrestled them, she beat each of them without much effort and then beat her father, Lee, with ease as well. Over the next year, Lee’s wife also increased her muscle mass, eventually surpassing Lee in arm wrestling and muscle size. Since then, comparisons between Lee and his wife's muscles have shown her continued physical development and dominance."
},
{
    "timestamp": "2010-00-00",
    "title": "Ami Lifts Desk to Free Dad",
    "entry": "At age 5, Ami came home from school to find her dad, Lee, pinned under a desk he couldn’t move. She lifted it up with one hand, freeing him effortlessly. This early demonstration of her strength hinted at the immense power she would continue to develop."
},
{
    "timestamp": "2011-00-00",
    "title": "Ami's First Arm Wrestling Victory",
    "entry": "When Ami was 6, she arm-wrestled her dad, Lee, for the first time and won easily, marking the beginning of a dynamic where her strength outpaced the rest of the family."
},
{
    "timestamp": "2011-00-00",
    "title": "Outgrowing Dad’s Shoes",
    "entry": "By age 6, Ami was already borrowing her dad's men's size 8 shoes for practicality, having outgrown most children's sizes. She eventually outgrew them and started borrowing her mom's shoes instead."
},
{
    "timestamp": "2012-00-00",
    "title": "Surpassing Family Shoe Sizes",
    "entry": "At age 7, Ami’s shoe size reached a men's 12, making her the largest in the family. She embraced her height and strength, showing pride in being the biggest."
},
{
    "timestamp": "2012-00-00",
    "title": "First Serious Arm Wrestling Challenge",
    "entry": "At 7 years old, Ami arm-wrestled her dad and was surprised by how easily she won. She remarked, 'Wow, Daddy, I knew I was stronger than you, but I thought you were stronger than that.' This realization solidified her confidence in her strength."
},
{
    "timestamp": "2016-00-00",
    "title": "The Family Showdown",
    "entry": "At age 12, Ami challenged all four family members—her mom, dad, and two brothers—to an arm wrestling match using only one of her arms. She easily overpowered them all, not even budging against their combined strength."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami's Imposing Presence",
    "entry": "At Thanksgiving dinner, Ami, still 12, half-yelled 'SIT DOWN' at everyone, who immediately complied without thinking—even the other adults. Her natural authority and size made it instinctual for people to obey her, a presence that continued to grow as she got older."
},
{
    "timestamp": "2016-00-00",
    "title": "Ami Reassures Family of Their Importance",
    "entry": "As Ami continued to grow, both in strength and size, the family sometimes felt insignificant next to her. However, her constant reassurance and kindness reinforced their importance to her, fostering a strong bond despite the power dynamics."
},



    
  ]
}
